frontend/app/controllers/l_img_controller.rb

  def view
     send_data Legislator.find(params[:id]).image, :type => 'image/jpg',:disposition => 'inline'
---
SELECT  "legislators".* FROM "legislators" WHERE "legislators"."id" = ? LIMIT 1  [["id", 412674]]