frontend/app/controllers/legislator_page_controller.rb

SELECT  "legislators".* FROM "legislators" WHERE "legislators"."id" = ? LIMIT 1  [["id", 412674]]
SELECT  "legislators".* FROM "legislators"  ORDER BY "legislators"."id" ASC LIMIT 1
SELECT "contents".* FROM "contents" WHERE "contents"."author" = 412673
SELECT  "contents".* FROM "contents"  ORDER BY "contents"."id" ASC LIMIT 1
---
  def view
    @legislator = Legislator.find(params[:id])
    # Get name
    @name = @legislator.name
    # Get description, i.e. "Senator from New York"
    party = @legislator.party.capitalize + (@legislator.party.include?("Demo") ? "ic" : "")
    @description = "#{party} #{@legislator.role.capitalize} from #{US_State.abbreviation_to_full(@legislator.state)}"
    # CODING HORROR here but that's ok
    @profile_pic = get_img_link(params[:id])
    @contents = Content.where(author: @legislator.id)
    puts "COUNT #{@contents.length}"