frontend/app/controllers/legislators_controller.rb

SELECT  "legislators".* FROM "legislators" WHERE "legislators"."id" = ? LIMIT 1  [["id", 3]]
---
    def set_legislator
      @legislator = Legislator.find(params[:id])